Revit 2027 API
DecimalSymbol Enumeration
 The symbol used to separate the integer and fractional parts of a number.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum DecimalSymbol
Public Enumeration DecimalSymbol
public enum class DecimalSymbol
type DecimalSymbol
Members
Member name | Value | Description
Comma | 1 |  A comma (",").
Dot | 0 |  A dot (".").
See Also
Reference
Autodesk.Revit.DB Namespace